Revit 2026 API

# FilterStringEndsWith Properties

---

The FilterStringEndsWith type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterStringRuleEvaluator) |

#### Reference

FilterStringEndsWith Class

Autodesk.Revit.DB Namespace